# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
ip_mask = input("Введите IP сеть и маску: ")
ip, mask = ip_mask.split("/")
bin_mask = "1"*int(mask)+"0"*(32-int(mask))
bin_oct0 =bin_mask[:8]
bin_oct1 =bin_mask[8:16]
bin_oct2 =bin_mask[16:24]
bin_oct3 =bin_mask[24:32]
oct0, oct1, oct2, oct3 = ip.split(".")
template = """
Network
{0:<8}  {1:<8}  {2:<8}  {3:<8}
{0:08b}  {1:08b}  {2:08b}  {3:08b}

Mask
/{4:}
{5:<10}{6:<10}{7:<10}{8:<10}
{5:<10b}{6:<10b}{7:<10b}{8:<10b}
"""

print(
    template.format(int(oct0), int(oct1), int(oct2),
    int(oct3), mask, int(bin_oct0,2), int(bin_oct1,2), int(bin_oct2,2), int(bin_oct3,2))
)




